---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarContainerType
source: html/2d4635c3-8af7-d600-9d6c-09fd847f6ebb.htm
---
# RebarContainerType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.